물병 = """물병자리 (1월 20일~2월 18일)
올해는 경제적으로 안정적인 기반이 마련되며, 미래 계획을 체계적으로 관리할 수 있는 시기입니다. 긍정적인 변화가 찾아오니 자신의 직감을 믿고 행동하세요. 다른 사람의 기대나 평가에 얽매이기보다는 자신이 원하는 목표를 향해 나아가는 것이 중요합니다."""
물고기 = """물고기자리 (2월 19일~3월 20일)
2025년에는 열정을 품고 몰입할 대상을 찾는 데 초점을 맞추세요. 적극적으로 행동할수록 만족스러운 결과를 얻게 될 것입니다. 하지만 완벽을 추구하느라 지나치게 에너지를 낭비하지 않도록 주의하세요. 차근차근 일을 마무리하고, 자신의 기준에 미치지 않더라도 너그럽게 받아들이는 태도가 필요합니다."""
양 = """양자리 (3월 21일~4월 19일)
올해는 꿈꿔온 목표를 향해 과감하게 나아갈 시기입니다. 중요한 변화가 시작되며, 지금까지 쌓은 경험이 빛을 발해 기대 이상의 성과를 이룰 수 있습니다. 약간의 용기와 대담성이 필요하며, 능동적으로 움직이는 만큼 더 많은 기회가 펼쳐질 것입니다."""
황소 = """황소자리 (4월 20일~5월 20일)
흥미진진한 일들이 기다리고 있으니 끌리는 일이 있다면 망설이지 말고 도전하세요. 창의적인 접근이 필요한 해로, 고정관념을 내려놓고 새로운 관점에서 문제를 바라보는 것이 중요합니다. 오래된 문제들도 해결의 실마리가 보이며, 그 과정에서 경제적 이익도 얻을 수 있습니다."""
쌍둥이 = """쌍둥이자리 (5월 21일~6월 21일)
커리어와 관계 등 모든 면에서 긍정적인 기운이 가득합니다. 지난해에 내린 중요한 결정들이 결실을 맺기 시작하며, 갈망하던 자유에 점점 가까워지고 있습니다. 자신의 직관을 믿고 긍정적인 마음가짐으로 앞으로 나아가세요. 대인 관계에 시간과 노력을 들이면 큰 보상이 돌아올 수 있습니다."""
게 = """게자리 (6월 22일~7월 22일)
모든 면에서 행운이 따르는 한 해입니다. 리더십과 재능을 인정받고, 모든 문제가 순조롭게 해결되며, 급여 인상까지 기대할 수 있습니다. 창의적인 분야에서 일하고 있다면 중요한 프로젝트에 참여할 기회가 찾아올 것입니다. 일과 가정을 함께 돌봐야 하는 상황이 올 수 있으니 건강 관리에 유의하세요."""
사자 = """사자자리 (7월 23일~8월 22일)
생산성이 높아지는 시기로, 필요한 기술을 익히고 효율적으로 자기 관리를 할 수 있습니다. 국제 관계나 교육과 관련된 일로 분주해질 수 있지만, 가까운 곳으로 여행을 다녀올 기회도 있을 것입니다. 금전운도 좋아 부수입을 얻거나 귀중한 선물을 받을 수 있습니다."""
처녀 = """처녀자리 (8월 23일~9월 22일)
훌륭한 금전운과 함께 한 해를 시작합니다. 큰돈이 들어올 가능성이 있으며, 부수입이나 보너스를 받을 수 있습니다. 커리어와 관련된 일에서 진전을 낼 가능성이 높고, 비즈니스 파트너나 협력자를 곁에 두면 상황을 헤쳐나가는 데 도움이 될 것입니다."""
천칭 = """천칭자리 (9월 23일~10월 22일)
안정감이 있는 상태로 지성, 감성, 신체의 삼박자가 잘 조화되어 있어 어떤 일을 하더라도 좋은 결과를 얻을 수 있습니다. 운이 좋더라도 혼자 일을 처리하기보다는 주변 사람들과 상의하고 협조를 구하는 것이 좋습니다. 독단적이거나 이기적인 사고를 자제하고 자중해야 합니다."""
전갈 = """전갈자리 (10월 23일~11월 22일)
상반기에는 주변의 여러 가지 일들을 정리해 나가도록 하세요. 해야 할 일의 우선순위를 생각하고, 중요한 것과 서두르지 않아도 되는 것을 나누면 운이 상승하겠습니다. 5월이 특히 신경 써야 할 시기입니다. 중요한 일에 집중하기 위해 나중에 해도 상관없는 일은 내려놓고 해야 할 일을 마주하세요."""
사수 = """사수자리 (11월 23일~12월 24일)
창의력이 상승하는 시기입니다. 금전운은 신중하게 관리해야 하며, 과도한 지출을 피하는 것이 좋습니다. 새로운 아이디어나 프로젝트를 시작하기에 적합한 때이니 적극적으로 도전해보세요."""
염소 = """염소자리 (12월 25일~1월 19일)
리더십이 발휘되는 시기로, 중요한 역할을 맡게 될 수 있습니다. 책임감 있게 임하면 좋은 결과를 얻을 수 있습니다. 건강 관리에 유의하고, 스트레스 해소를 위한 취미나 운동을 시작하는 것이 좋습니다."""

print("""--------------
오늘의 별자리 운세
--------------
1. 물병  2. 물고기  3. 양  4. 황소  5. 쌍둥이  6. 게
7. 사자  8. 처녀   9. 천칭 10.전갈  11.사수   12.염소
""")

num = int(input("당신의 별자리를 선택해 주세요 > "))

if num < 1 or num > 12:
    print("잘못 입력 되었습니다.")
    exit()


print()
print("-" * 40)

if num == 1:
    print(물병)
elif num == 2:
    print(물고기)
elif num == 3:
    print(양)
elif num == 4:
    print(황소)
elif num == 5:
    print(쌍둥이)
elif num == 6:
    print(게)
elif num == 7:
    print(사자)
elif num == 8:
    print(처녀)
elif num == 9:
    print(천칭)
elif num == 10:
    print(전갈)
elif num == 11:
    print(사수)
elif num == 12:
    print(염소)



print()
print("=" * 20)
print("이용해 주셔서 감사합니다.")




